tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/science"
tap "homebrew/services"
tap "synthinet/synthinet"

# Java stuff
brew "gradle"
brew "maven"
brew "sbt"
brew "scala"

# Databases
brew "mysql", restart_service: true
brew "mongodb", restart_service: true

brew "rbenv"
brew "rbenv-default-gems"
brew "rbenv-gemset"

# AWS
brew "git-secrets"

# Editors
brew "macvim", args: ["with-override-system-vim"]
brew "emacs", args: ["with-cocoa"]

# python
brew "python3"
brew "autoenv"

# JS
brew "nvm"
brew "flow"

# Tools
brew "tree"
brew "ack"

# Unclassified stuff (which I am lazy to classify and always becomes hard to manage)
brew "autossh"
brew "bash-completion"
brew "openssh", args: ["with-keychain-support"]
brew "wget", args: ["with-iri"]

# brew tap bramstein/webfonttools
tap "bramstein/webfonttools"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
