tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "bazelbuild/tap"


# brew deps
brew "mercurial"
brew "glide"

# Clang stuff
brew "gcc"
brew "gdb"
brew "cmake"

# Java stuff
cask "java"
brew "gradle"
brew "maven"
brew "sbt"
brew "scala"

# Php
brew "php"

# Haskell
brew "ghc"

# Databases
brew "mysql", restart_service: true
cask "mongodb", restart_service: true
cask "jeromelebel-mongohub"

brew "rbenv"
brew "rbenv-default-gems"
brew "rbenv-gemset"

# AWS
brew "git-secrets"
brew "awscli"

# Google cloud
cask "google-cloud-sdk"


#go
brew "go"
brew "dep"

# git
brew "hub"

# Editors
brew "macvim"
cask "emacs"
 
# python
brew "python"
brew "autoenv"
# R
brew "r"


# Tools
brew "ledger"
brew "hledger"
brew "tree"
brew "ack"
brew "wget"
brew "wiki"
brew "autojump"
brew "fzf"
 
# Commandline json processor
brew "jq"

## # Unclassified stuff (which I am lazy to classify and always becomes hard to manage)
brew "autossh"
brew "bash"
brew "bash-completion"
brew "openssh"
 
# brew tap bramstein/webfonttools
tap "bramstein/webfonttools"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

# silver-searcher
brew "the_silver_searcher"

# javascript
brew "nvm"


# k8s
cask "virtualbox"
cask "minikube"
brew "kubernetes-helm"
brew "kubernetes-cli"
brew "kubectx"

# Vault
brew "vault"

# Rust
brew "rustup-init"

# Android tools
cask "android-platform-tools"

brew "bazel"

