tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/science"
tap "homebrew/services"
tap "buo/cask-upgrade"

# Clang stuff
brew "gcc"

# Java stuff
cask "java"
brew "gradle"
brew "maven"
brew "sbt"
brew "scala"

# Databases
brew "mysql", restart_service: true
brew "mongodb", restart_service: true
cask "mongohub"

brew "rbenv"
brew "rbenv-default-gems"
brew "rbenv-gemset"

# AWS
brew "git-secrets"
brew "awscli"

# git
brew "hub"

# Editors
brew "macvim", args: ["with-override-system-vim"]
cask "emacs"

# python
brew "python"
brew "python3"
brew "autoenv"

# R
brew "r"

# JS
brew "nvm"
brew "flow"

# Tools
brew "ledger"
brew "tree"
brew "ack"
brew "cmake"
brew "wget", args: ["with-iri"]
brew "wiki"

# Unclassified stuff (which I am lazy to classify and always becomes hard to manage)
brew "autossh"
brew "bash"
brew "bash-completion@2"
brew "openssh", args: ["with-keychain-support"]

# brew tap bramstein/webfonttools
tap "bramstein/webfonttools"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

# silver-searcher
brew "the_silver_searcher"

# javascript
brew "yarn", args: ["without-node"]

# k8s
cask "virtualbox"
cask "minikube"

